package test;

import com.bank.utils.Base64Utils;

public class Test2 {
	private static String[] labels = {
		"组织机构编码","年月","数据报送机构","税务识别码","主营业务收入","主营业务收入出口产品销售收入","主营业务收入进口产品销售收入","折扣与拆让","主营业务收入净额","主营业务成本","主营业务成本出口产品销售成本",
		"主营业务税金及附加","经营费用","其他","递延收益","代购代销收入","其他","主营业务利润","其他业务利润","营业费用","管理费用","财务费用","其他","营业利润","投资收益","期货收益","补贴收入",
		"补贴收入补贴前亏损的企业补贴收入","营业外收入","营业外收入处置固定资产净收益","营业外收入非货币性交易收益","营业外收入出售无形资产收益","营业外收入罚款净收入","其他","其他用以前年度含量工资节余弥补利润","营业外支出",
		"营业外支出处置固定资产净损失","营业外支出债务重组损失","营业外支出罚款支出","营业外支出捐赠支出","其他支出","其他支出结转的含量工资包干节余","利润总额","所得税","少数股东损益","未确认的投资损失","净利润","年初未分配利润",
		"盈余公积补亏","其他调整因素","可供分配的利润","单项留用的利润","补充流动资本","提取法定盈余公积","提取法定公益金","提取职工奖励及福利基金","提取储备基金","提取企业发展基金","利润归还投资","其他","可供投资者分配的利润",
		"应付优先股股利","提取任意盈余公积","应付普通股股利","转作资本的普通股股利","其他","未分配利润","未分配利润应由以后年度税前利润弥补的亏损"
	};
	public static void main(String[] args) {
		System.out.println(labels.length);
		int labelIndex = 0;
		try {
			for(int i=0;i<labels.length;i++){
				System.out.print(labels[labelIndex++]);
				System.out.print(",");
				if(i==0)
					throw new Exception();
			}
		}catch(Exception e){
			System.out.println("===="+labels[--labelIndex]);
		}
	}

}
